'use strict';

module.exports = {
    sex              : ['Мъж', 'Жена'],
    months           : [
        'Януари',
        'Февруари',
        'Март',
        'Април',
        'Май',
        'Юни',
        'Юли',
        'Август',
        'Септември',
        'Октомври',
        'Ноември',
        'Декември'
    ],
    education        : [
        'Начално',
        'Основно',
        'Средно',
        'Средно специално',
        'Бакалавър',
        'Професионален Бакалавър',
        'Магистър',
        'Доцтор'
    ],
    reasonForContract: [
        '01 - безсрочен трудов договор по чл.67, ал.1, т.1',
        '02 - срочен трудов договор по чл.68, ал.1,т. 1 от КТ',
        '03 - трудов договор по чл.68, ал.1, т.2 от КТ',
        '04 - трудов договор по чл.68, ал.1, т.3 от КТ',
        '05 - трудов договор по чл.68, ал.1, т.4 от КТ',
        '06 - трудов договор по чл.68, ал.1, т.5 от КТ',
        '08 - споразумение по чл.107 от КТ във връзка с чл.83 от КТ',
        '09 - споразумение по чл.107 от КТ във връзка с чл.89 от КТ',
        '10 - допълнителен трудов договор по чл.110 от КТ',
        '11 - допълнителен трудов договор по чл.111 от КТ',
        '12 - трудов договор по чл.114 от КТ',
        '13 - постановление по чл.405а от КТ',
        '14 - трудов договор за ученичество по чл.230 от КТ',
        '15 - трудов договор за вътрешно заместване по чл. 259 от КТ'
    ]
};